{
    "type": "success",
    "value": [
      {
        "id": 515,
        "joke": "Chuck Norris compresses his files by doing a flying round house kick to the hard drive.",
        "categories": [
          "nerdy"
        ]
      },
      {
        "id": 352,
        "joke": "Chuck Norris doesn't see dead people. He makes people dead.",
        "categories": []
      },
      {
        "id": 295,
        "joke": "The pie scene in &quot;American Pie&quot; is based on a dare Chuck Norris took when he was younger. However, in Chuck Norris' case, the &quot;pie&quot; was the molten crater of an active volcano.",
        "categories": []
      },
      {
        "id": 303,
        "joke": "Fact: Chuck Norris doesn't consider it sex if the woman survives.",
        "categories": []
      },
      {
        "id": 357,
        "joke": "The word 'Kill' was invented by Chuck Norris. Other words were 'Die', 'Beer', and 'What'.",
        "categories": []
      },
      {
        "id": 61,
        "joke": "Chuck Norris once ate a whole cake before his friends could tell him there was a stripper in it.",
        "categories": []
      },
      {
        "id": 193,
        "joke": "Most boots are made for walkin'. Chuck Norris' boots ain't that merciful.",
        "categories": []
      },
      {
        "id": 232,
        "joke": "Chuck Norris uses a night light. Not because Chuck Norris is afraid of the dark, but the dark is afraid of Chuck Norris.",
        "categories": []
      },
      {
        "id": 604,
        "joke": "Chuck Norris understands every definition in the Oxford Thesaurus, except one - &quot;mercy&quot;.",
        "categories": []
      },
      {
        "id": 156,
        "joke": "There is no such thing as global warming. Chuck Norris was cold, so he turned the sun up.",
        "categories": []
      },
      {
        "id": 312,
        "joke": "Jesus can walk on water, but Chuck Norris can walk on Jesus.",
        "categories": []
      },
      {
        "id": 13,
        "joke": "Chuck Norris once challenged Lance Armstrong in a &quot;Who has more testicles?&quot; contest. Chuck Norris won by 5.",
        "categories": [
          "explicit"
        ]
      },
      {
        "id": 488,
        "joke": "Chuck Norris doesn't pair program.",
        "categories": [
          "nerdy"
        ]
      },
      {
        "id": 506,
        "joke": "Chuck Norris programs do not accept input.",
        "categories": [
          "nerdy"
        ]
      },
      {
        "id": 249,
        "joke": "Maslow's theory of higher needs does not apply to Chuck Norris. He only has two needs: killing people and finding people to kill.",
        "categories": []
      },
      {
        "id": 226,
        "joke": "&quot;Brokeback Mountain&quot; is not just a movie. It's also what Chuck Norris calls the pile of dead ninjas in his front yard.",
        "categories": []
      },
      {
        "id": 324,
        "joke": "Chuck Norris drinks napalm to quell his heartburn.",
        "categories": []
      },
      {
        "id": 26,
        "joke": "Chuck Norris is the only human being to display the Heisenberg uncertainty principle - you can never know both exactly where and how quickly he will roundhouse-kick you in the face.",
        "categories": [
          "nerdy"
        ]
      },
      {
        "id": 509,
        "joke": "Chuck Norris's OSI network model has only one layer - Physical.",
        "categories": [
          "nerdy"
        ]
      },
      {
        "id": 619,
        "joke": "Chuck Norris can lock a safe and keep the key inside it.",
        "categories": []
      },
      {
        "id": 307,
        "joke": "Chuck Norris never has to wax his skis because they're always slick with blood.",
        "categories": []
      },
      {
        "id": 375,
        "joke": "After taking a steroids test doctors informed Chuck Norris that he had tested positive. He laughed upon receiving this information, and said &quot;of course my urine tested positive, what do you think they make steroids from?&quot;",
        "categories": []
      },
      {
        "id": 365,
        "joke": "Chuck Norris has never won an Academy Award for acting... because he's not acting.",
        "categories": []
      },
      {
        "id": 52,
        "joke": "When Chuck Norris sends in his taxes, he sends blank forms and includes only a picture of himself, crouched and ready to attack. Chuck Norris has not had to pay taxes, ever.",
        "categories": []
      },
      {
        "id": 191,
        "joke": "The easiest way to determine Chuck Norris' age is to cut him in half and count the rings.",
        "categories": []
      },
      {
        "id": 339,
        "joke": "Think of a hot woman. Chuck Norris did her.",
        "categories": []
      },
      {
        "id": 42,
        "joke": "Chuck Norris doesn't churn butter. He roundhouse kicks the cows and the butter comes straight out.",
        "categories": []
      },
      {
        "id": 321,
        "joke": "Chuck Norris is widely predicted to be first black president. If you're thinking to yourself, &quot;But Chuck Norris isn't black&quot;, then you are dead wrong. And stop being a racist.",
        "categories": []
      },
      {
        "id": 507,
        "joke": "Chuck Norris can install iTunes without installing Quicktime.",
        "categories": [
          "nerdy"
        ]
      },
      {
        "id": 461,
        "joke": "Chuck Norris finished World of Warcraft.",
        "categories": [
          "nerdy"
        ]
      },
      {
        "id": 305,
        "joke": "Chuck Norris knows everything there is to know - Except for the definition of mercy.",
        "categories": []
      },
      {
        "id": 588,
        "joke": "Chuck Norris knows Victoria's secret.",
        "categories": []
      },
      {
        "id": 471,
        "joke": "Chuck Norris's keyboard doesn't have a Ctrl key because nothing controls Chuck Norris.",
        "categories": [
          "nerdy"
        ]
      },
      {
        "id": 451,
        "joke": "Chuck Norris writes code that optimizes itself.",
        "categories": [
          "nerdy"
        ]
      },
      {
        "id": 81,
        "joke": "Chuck Norris invented his own type of karate. It's called Chuck-Will-Kill.",
        "categories": []
      },
      {
        "id": 439,
        "joke": "Chuck Norris can kick through all 6 degrees of separation, hitting anyone, anywhere, in the face, at any time.",
        "categories": []
      },
      {
        "id": 140,
        "joke": "Chuck Norris built a better mousetrap, but the world was too frightened to beat a path to his door.",
        "categories": []
      },
      {
        "id": 422,
        "joke": "Mr. T pities the fool. Chuck Norris rips the fool's head off.",
        "categories": []
      },
      {
        "id": 33,
        "joke": "Chuck Norris once shot down a German fighter plane with his finger. By yelling &quot;Bang!&quot;",
        "categories": []
      },
      {
        "id": 62,
        "joke": "Some people like to eat frogs' legs. Chuck Norris likes to eat lizard legs. Hence, snakes.",
        "categories": []
      },
      {
        "id": 151,
        "joke": "Chuck Norris doesn't step on toes. Chuck Norris steps on necks.",
        "categories": []
      },
      {
        "id": 566,
        "joke": "Chuck Norris could use anything in java.util.* to kill you, including the javadocs.",
        "categories": [
          "nerdy"
        ]
      },
      {
        "id": 118,
        "joke": "Chuck Norris can touch MC Hammer.",
        "categories": []
      },
      {
        "id": 320,
        "joke": "The First rule of Chuck Norris is: you do not talk about Chuck Norris.",
        "categories": []
      },
      {
        "id": 456,
        "joke": "All browsers support the hex definitions #chuck and #norris for the colors black and blue.",
        "categories": [
          "nerdy"
        ]
      },
      {
        "id": 77,
        "joke": "Chuck Norris can divide by zero.",
        "categories": []
      },
      {
        "id": 256,
        "joke": "How many roundhouse kicks does it take to get to the center of a tootsie pop? Just one. From Chuck Norris.",
        "categories": []
      },
      {
        "id": 472,
        "joke": "When Chuck Norris is web surfing websites get the message &quot;Warning: Internet Explorer has deemed this user to be malicious or dangerous. Proceed?&quot;.",
        "categories": [
          "nerdy"
        ]
      },
      {
        "id": 86,
        "joke": "Wilt Chamberlain claims to have slept with more than 20,000 women in his lifetime. Chuck Norris calls this &quot;a slow Tuesday.&quot;",
        "categories": []
      },
      {
        "id": 350,
        "joke": "Chuck Norris starts everyday with a protein shake made from Carnation Instant Breakfast, one dozen eggs, pure Colombian cocaine, and rattlesnake venom. He injects it directly into his neck with a syringe.",
        "categories": []
      }
    ]
  }